bridgeDeckLES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
 // +z plane
 (0 0 0)

 (5477.5 824.25 -5)
 (-5477.5 824.25 -5)
 (-5477.5 -824.25 -5)
 (5477.5 -824.25 -5)

 (273.875 41.2125 -5)
 (-273.875 41.2125 -5)
 (-273.875 -41.2125 -5)
 (273.875 -41.2125 -5)

 (253.875 10.612 -5)
 (-253.875 10.612 -5)
 (-253.875 -41.2125 -5)
 (253.875 -41.2125 -5)

 (273.875 824.25 -5)
 (-273.875 824.25 -5)

 (-5477.5 41.2125 -5)
 (-5477.5 -41.2125 -5)

 (-273.875 -824.25 -5)
 (-253.875 -824.25 -5)
 (253.875 -824.25 -5)
 (273.875 -824.25 -5)

 (5477.5 -41.2125 -5)
 (5477.5 41.2125 -5)

 // -z plane
 (5477.5 824.25 5)
 (-5477.5 824.25 5)
 (-5477.5 -824.25 5)
 (5477.5 -824.25 5)

 (273.875 41.2125 5)
 (-273.875 41.2125 5)
 (-273.875 -41.2125 5)
 (273.875 -41.2125 5)

 (253.875 10.612 5)
 (-253.875 10.612 5)
 (-253.875 -41.2125 5)
 (253.875 -41.2125 5)

 (273.875 824.25 5)
 (-273.875 824.25 5)

 (-5477.5 41.2125 5)
 (-5477.5 -41.2125 5)

 (-273.875 -824.25 5)
 (-253.875 -824.25 5)
 (253.875 -824.25 5)
 (273.875 -824.25 5)

 (5477.5 -41.2125 5)
 (5477.5 41.2125 5)

);


blocks
(

    // block 0
    hex (1 13 5 22 23 35 27 44)
    (520 80 1)
    simpleGrading (0.2 0.2 1)

    // block 1
    hex (14 2 15 6 36 24 37 28)
    (520 80 1)
    simpleGrading (5 0.2 1)

    // block 2
    hex (7 16 3 17 29 38 25 39)
    (520 80 1)
    simpleGrading (5 5 1)

    // block 3
    hex (21 8 20 4 43 30 42 26)
    (520 80 1)
    simpleGrading (0.2 5 1)

    // block 4
    hex (13 14 6 5 35 36 28 27)
    (100 80 1)
    simpleGrading (1 0.2 1)

    // block 5
    hex (6 15 16 7 28 37 38 29)
    (520 80 1)
    simpleGrading (5 1 1)

    // block 6
    hex (12 11 18 19 34 33 40 41)
    (80 80 1)
    simpleGrading (1 5 1)

    // block 7
    hex (22 5 8 21 44 27 30 43)
    (520 80 1)
    simpleGrading (0.2 1 1)

    // block 8
    hex (11 7 17 18 33 29 39 40)
    (20 80 1)
    simpleGrading (1 5 1)

    // block 9
    hex (8 12 19 20 30 34 41 42)
    (20 80 1)
    simpleGrading (1 5 1)

    // block 10
    hex (9 10 11 12 31 32 33 34)
    (80 50 1)
    simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (24 2 15 37)
            (37 15 16 38)
            (38 16 3 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 23 44 22)
            (22 44 43 21)
            (21 43 26 4)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 13 35 23)
            (13 14 36 35)
            (14 2 24 36)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (3 17 39 25)
            (17 18 40 39)
            (18 19 41 40)
            (19 20 42 41)
            (20 4 26 42)
        );
    }
    innerWall
    {
        type wall;
        faces
        (
            (6 5 27 28)
            (7 6 28 29)
            (7 11 33 29)
            (11 10 32 33)
            (10 9 31 32)
            (9 12 34 31)
            (12 8 30 34)
            (8 5 27 30)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 22 5 13)
            (14 6 15 2)
            (7 17 3 16)
            (21 4 20 8)

            (13 5 6 14)
            (6 7 16 15)
            (12 19 18 11)
            (22 21 8 5)

            (11 18 17 7)
            (8 20 19 12)

            (9 12 11 10)


            (23 35 27 44)
            (36 24 37 28)
            (29 38 25 39)
            (43 30 42 26)

            (35 36 28 27)
            (28 37 38 29)
            (34 33 40 41)
            (44 27 30 43)

            (33 29 39 40)
            (30 34 41 42)

            (31 32 33 34)

        );
    }
);

// ************************************************************************* //
